## Production: load-balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                 NAME                 |
|--------|--------------------------------------|
| add    | `aws_alb_listener_rule.security_txt` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_alb_listener_rule.security_txt will be created
  + resource "aws_alb_listener_rule" "security_txt" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:472286471787:listener/app/wordpress/e5390715eaeedd67/7ffe6e01b89fd50c"
      + priority     = 100
      + region       = "ca-central-1"
      + tags         = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress"
        }
      + tags_all     = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress"
        }

      + action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = <<-EOT
                    Contact: mailto:ZZTBSCYBERS@tbs-sct.gc.ca
                    Contact: https://hackerone.com/tbs-sct/
                    Policy: https://hackerone.com/tbs-sct/policy
                    Canonical: https://alpha.canada.ca/.well-known/security.txt
                    Preferred-Languages: en, fr
                    Expires: 2026-03-02T12:00:00.000Z
                EOT
              + status_code  = "200"
            }
        }

      + condition {
          + path_pattern {
              + regex_values = []
              + values       = [
                  + "/.well-known/security.txt",
                ]
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.cloudfront_logs,
  on s3.tf line 4, in resource "aws_s3_bucket" "cloudfront_logs":
   4: resource "aws_s3_bucket" "cloudfront_logs" {

grant is deprecated. Use the aws_s3_bucket_acl resource instead.

(and 5 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/athena_access_logs/athena_access_logs/locals.tf line 6, in locals:
   6:   region     = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.wordpress_cloudfront"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.wordpress_new[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.wordpress_new_cloudfront[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.security_txt"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cache_buster"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.cache_buster"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.cloudfront_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.wordpress_waf"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.wordpress_waf_alb"]

35 tests, 19 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
